def whole():
        while True:
            if input("按0继续生成地名，按其他键结束") == str(0):
                main()
            else:
                exit()

def main():
    import random
    k = 0
    s = int(input("设定输出个数："))
    n = int(input("选择输出地名字数（2/3）："))
    
    if s <= 0 or s >=1001:
        print("输出个数为1到1000的整数")
        whole()
    while not k == int(s):
        k = k + 1
        def a(input_text, num_samples=1):
            excluded_chars = {"区","县","、","市","州"," ","口","门","头","尾","乡","城","都","溪","台","岛","哈"}
        
            filtered_chars = [char for char in input_text if char not in excluded_chars]
        
            results_a = []
            for _ in range(num_samples):
                sampled_chars = random.sample(filtered_chars, 1)
                results_a.append("".join(sampled_chars))
        
            return results_a

        def b(input_text, num_samples=1):
            excluded_chars = {"区","县","、","市"," ","哈"}
        
            filtered_chars = [char for char in input_text if char not in excluded_chars]
        
            results_b = []
            for _ in range(num_samples):
                sampled_chars = random.sample(filtered_chars, 1)
                results_b.append("".join(sampled_chars))
        
            return results_b

        def c(prefix, num_samples=1):
            excluded_chars = {"、"}
        
            filtered_chars = [char for char in prefix if char not in excluded_chars]
        
            results_c = []
            for _ in range(num_samples):
                sampled_chars = random.sample(filtered_chars, 1)
                results_c.append("".join(sampled_chars))
        
            return results_c
        
    #省级：重庆、天津、上海、北京、香港
    #地级：
        #黑龙江：哈尔滨、
        #吉林：长春、
        #辽宁：沈阳、大连、锦州、
        #浙江：杭州、绍兴、宁波、金华、台州、
        #安徽：合肥、滁州、芜湖、
        #贵州：贵阳、遵义、黔南、黔东南、黔西南、
        #云南：昆明、
        #甘肃：兰州
        #宁夏：银川
        #福建：福州、
        #四川：成都、凉山、甘孜、
        #陕西：西安、咸阳、
        #海南：海口、三亚
        #江苏：南京、苏州、泰州、扬州、无锡、常州、镇江、南通、徐州、
        #江西：南昌、九江、上饶、景德镇、赣州、
        #广东：广州、深圳、茂名、湛江、清远、肇庆、佛山、
        #广西：南宁、桂林、柳州、梧州、
        #河北：石家庄、张家口、衡水、保定、唐山、沧州、邯郸、邢台
        #河南：郑州、洛阳、
        #山东：济南、日照、威海、青岛、烟台、
        #山西：太原、临汾、
        #湖北：武汉、
        #湖南：长沙、株洲、湘潭、

        input_text = "黄岛区、崂山区、李沧区、城阳区、即墨区、胶州市、平度市、莱芝罘区、福山区、牟平区、蓬莱区、龙口市、招远市、海阳市中山区、西岗区、沙河口区、甘井子区、旅顺口区、金州区、普兰店区、瓦房店市、庄河市、长海县古塔区、凌河区、太和区、凌海市、北镇黑山义东港区、岚山区、五莲县、莒县环翠区、文登区、荣成市云龙区、贾汪区、泉山区、铜山区、新沂市、邳州市、丰县、沛县、睢宁县崇川区、通州区、海门区、如皋市、启东市、海安市、如东县红花岗区、汇川区、播州区、赤水市、仁怀市、桐梓县、绥阳县、正安县、凤冈县、湄潭县、余庆县、习水县、道真务川秦都区、杨陵区、渭城区、兴平市、彬州市、三原县、泾阳县、乾县、礼泉县、永寿县、长武县、旬邑县、淳化县、武功县天元区、芦淞区、荷塘区、石峰区、渌口区、醴陵市、攸县、茶陵县、炎陵县雨湖区、岳塘区、湘乡市、韶山市琅琊区、南谯区、天长市、明光市、来安县、全椒县、定远县、凤阳县镜湖区、鸠江区、弋江区、湾沚区、繁昌区、无为市、南陵县涧西区、西工区、瀍河洛龙偃师孟津区、新安县、栾川县、嵩汝阳县、宜阳县、洛宁县、伊川县古冶区、开平区、丰南区、丰润区、曹妃甸区、遵化市、迁安市、滦乐亭县、迁西县、玉田县都匀市、福泉市、荔波县、贵定县、瓮安县、独山县、平塘县、罗甸县、长顺县、龙里县、惠水县、三都凯里市、黄平县、施秉县、三穗县、镇远县、岑巩县、天柱县、锦屏县、剑河县、台江县、黎平县、榕江县、从江县、雷山县、麻江县、丹寨县兴义市、兴仁市、普安县、晴隆县、贞丰县、望谟县、册亨县、安龙县新华区、运河区、泊头市、任丘市、黄骅市、河间沧青东光海兴盐山肃宁南皮吴桥献孟梁溪区、锡山区、惠山区、滨湖区、新吴区、江阴市、宜兴市天宁区、钟楼区、新北区、武进区、金坛区、溧阳市京口区、润州区、丹徒区、丹阳市、扬中市、句容市秀峰区、叠彩区、象山区、七星区、雁山区、临桂区、阳朔县、灵川县、全州县、兴安县、永福县、灌阳县、龙胜、资源县、平乐县、恭城、荔浦市鱼峰区、鹿寨县、融安县、融水、三江万秀区、长洲区、龙圩区、岑溪市、苍梧县、藤县、蒙山县西昌市、会理市、木里盐源德昌县、会东县、宁南县、普格县、金阳县、昭觉县、喜德县、冕宁县、越西县、甘洛县、美姑县、雷波县尧都区、侯马市、霍州市、曲沃县、翼城县、襄汾县、洪洞县、古县、安泽县、浮山县、吉县、乡宁县、大宁县、隰县、永和县、蒲县、汾西县章贡区、南康区、赣县区、瑞金市、龙南市、信丰县、大余县、上犹县、崇义县、安远县、定南县、全南县、宁都县、于都县、兴国县、会昌县、寻乌县、石城县康定市、泸定县、丹、九龙县、雅江县、道孚县、炉霍县、新龙县、德格县、白玉县、石渠县、理塘县、稻城县、得荣县邯山区、丛台区、复兴区、肥乡区、永年区、武安市、临漳县、成安县、大名县、涉磁邱鸡泽县、广平县、馆陶县、魏曲周县襄都区、信都区、任泽区、南和区、南宫市、沙河市、临城县、内丘县、柏乡县、隆尧县、宁晋县、巨鹿县、新河县、广宗县、平乡县、威县、清河县、临西县越城区、柯桥区、上虞区、诸暨市、嵊州市、新昌县浔阳区、濂溪区、柴桑区、瑞昌市、共青城市、庐山市、武宁县、修水县、永修县、德安县、都昌县、湖口县、彭泽县信州区、广丰区、广信区、德兴市、玉山县、铅山县、横峰县、弋阳县、余干县、鄱阳县、万年县、婺源县昌江区、珠山区、乐平市、浮梁县椒江区、黄岩区、路桥区、温岭市、临海市、玉环市、三门县、天台县、仙居县海陵区、高港区、姜堰区、兴化市、靖江市、泰兴市广陵区、邗江区、江都区、仪征市、高邮市、宝应县竞秀区、莲池区、满城区、清苑区、徐水区、涿州市、安国市、高碑店市、定州市蠡县、涞水县、阜平县、定兴县、唐县、高阳县、容城县、涞源县、望都县、安新县、易县、曲阳县、博野县、雄县、顺平县桃城区、冀州区、深州市、枣强县、武邑县、武强县、饶阳县、安平县、故城县、景县、阜城县桥东区、桥西区、宣化区、下花园区、万全区、崇礼区、张北县、康保县、沽源县、尚义县、蔚县、阳原县、怀安县、怀来县、涿鹿县、赤城县清城区、清新区、英德市、连州市、佛冈县、阳山县、连山、连南端州区、鼎湖区、高要区、四会市、广宁县、怀集县、封开县、德庆县禅城区、南海区、顺德区、三水区、高明区赤坎区、霞山区、坡头区、麻章区、雷州市、廉江市、吴川市、遂溪县、徐闻县茂南区、电白区、高州市、化州市、信宜市海棠区、吉阳区、天涯区、崖州区婺城区、金东区、兰溪市、义乌市、东阳市、永康市、武义县、浦江县、磐安县海曙区、江北区、北仑区、镇海区、鄞州区、奉化区、余姚市、慈溪市、象山县、宁海县城关区、七里河区、西固区、安宁区、红古区、永登县、皋兰县、榆中县兴庆区、西夏区、金凤区、灵武市、永宁县、贺兰县青云谱青山湖新建区、红谷滩区安义县、进贤县姑苏区、虎丘区、吴中区、相城区、吴江区、常熟市、张家港市、昆山市、太仓市芙蓉区、天心区、岳麓区、开福区、雨花区、望城区、长沙县、宁乡县、浏阳市五华区、盘龙区、官渡区、西山区、东川区、呈贡区、晋宁区、安宁市、富民县、宜良县、石林、嵩明县、禄劝、寻甸南明区、云岩区、花溪区、乌当区、白云区、观山湖区、清镇市、开阳县、息烽县、修文县兴宁区、青秀区、江南区、西乡塘区、良庆区、邕宁区、武鸣区、横州市、隆安县、马山县、上林县、宾阳县秀英区、龙华区、琼山区、美兰区鼓楼区、台江区、仓山区、马尾区、晋安区、长乐区、福清市、闽侯县、连江县、罗源县、闽清县、永泰县、平潭县瑶海庐阳蜀山区、包河区、长丰庐江巢湖市小店区、迎泽区、杏花岭区、尖草坪区、万柏林区、晋源区、清徐县、阳曲古交中原区、二七区、金水区、惠济区、管城上街区、新郑市、登封市、新密市、荥阳巩义中牟县桥西区、新华区、裕华区、井陉藁城区、鹿泉区、栾城区、辛集市、晋州市、新乐市、正定县、深泽县、无极县、赵县、高邑县、元氏县、赞皇县、平山县、灵寿县、行唐县历下槐荫区、天桥区、历城区、长清区、章丘区、济阳区、莱芜区、钢城区、平阴县、商河县道里区、南岗区、道外区、平房区、松北区、香坊区、阿城区、双城区、尚志市、五常市、依兰县、方正县、宾县、木兰县、通河县、延寿县和平区、沈河区、铁西区、皇姑区、大东区、浑南区、于洪区、沈北辽中新民市法库、康平县南关区、宽城区、朝阳区、二道区、绿园区、双阳区、九台区、农安榆树德惠江岸区、江汉区、硚口区、汉阳区、武昌区、洪山区、青山区蔡甸区、江夏区、黄陂区、新洲区、汉南区桐庐淳安建德上城区、下城区、拱墅区、江干区、西湖区、滨江区、萧山区、余杭区、富阳区、临安区锦江区、青羊区、金牛区、武侯区、成华区、龙泉驿区、青白江区、新都区、温江区、金堂县、双流县、郫县、大邑县、蒲江县、新津县、崇彭邛崃市碑林区、莲湖区、雁塔区、未央区、灞桥区、阎良区、临潼区、长安区、高陵区、周至县、蓝田县、罗湖福田南山宝安龙岗盐田龙华坪山光明荔湾越秀海珠天河白云黄埔番禺花都区南沙区从化区增城区万州黔江涪陵区、渝中江北南岸区、北碚区、渝北区、长寿江津合川永川区、南川区、綦江区、大足区、璧山区、铜梁区、潼南区、荣昌区、开州梁平武隆城口丰都垫江云阳奉节巫山巫溪石柱秀山酉阳彭水和平区南开区红桥区、东丽区、西青区、津南区、北辰区、武清区、宝坻区、静海区、宁河区、蓟州区浦东徐汇黄浦杨浦区、虹口区、闵行区、宝山嘉定金山松江青浦奉贤崇明静安长宁普陀朝阳丰台区海淀区房山区、通州区、顺义区、昌平区、大兴区、怀柔区、平谷密云延庆区荃湾屯门元朗大埔西贡沙田葵青离岛玄武秦淮建邺鼓楼浦口栖霞雨花 江宁六合溧水 高淳白下北京上海天津重庆安庆蚌埠亳州池州滁州阜阳合肥淮北淮南黄山六安宿州铜陵芜湖宣城常德 长沙 郴 衡阳 怀化 娄底 邵阳 湘潭 湘西 益阳 永州 岳阳 株洲固原 吴忠 银川 中卫高雄 花莲 基隆 嘉义 金门县 连江县 马祖 苗栗县南投县 澎湖县 屏东县 台北 台东县 台南 台中桃园 新北 新竹 宜兰县云林县彰化县福州 龙岩 南平 宁德 莆田 泉州 三明 厦门 漳州保定沧州承德邯郸衡水 廊坊 唐山 邢台白城 白山 吉林 辽源 四平 松原 通化 长春滨州德州东营 菏泽 济南 济宁 聊城 临沂 青岛 日照 泰安 威海 潍坊 烟台 枣庄淄博昌都 林芝 那曲 白银 定西 甘南 嘉峪 金昌 酒泉 兰州临夏陇南 平凉 庆阳 天水 武威 张掖潮州 东莞 佛山 广州 河源 惠 江门 揭阳茂名梅州清远汕头汕尾韶关 深圳 阳江 云浮 湛江 肇庆 中山 珠海安阳 鹤壁 济源 焦作 开封 洛阳 漯河 南阳 濮阳 商丘 新乡 信阳 许昌 郑州周口抚赣吉安 九江 南昌 萍乡 上饶 新余 宜春 鹰潭安康 宝鸡汉中商洛铜川 渭南 西安 咸阳 延安 榆林大同 晋城 晋中 临汾 吕梁 朔州太原忻州阳泉 运城 长治鞍山 本溪 朝阳 大连 丹东 抚顺 阜新 葫芦岛 锦州辽阳盘锦 沈阳 铁岭 营口鹤岗 黑河 鸡西绥化伊春百色 北海 崇左 贵港 桂林 河池 贺州 来宾 柳州 南宁 钦州 梧州 玉林安顺 毕节 贵阳 铜仁遵义鄂州恩施黄冈 黄石 荆门 荆州 潜江十堰 随州 天门 武汉 仙桃 咸宁 襄阳孝感宜昌 昌吉 哈密北屯和田昆玉双河塔城伊犁巴中 成都 达 德阳 甘孜广安广元 乐山 凉山泸眉山 绵阳 南充 内江 遂宁 雅安 宜宾 资阳 自贡杭州湖州 嘉兴 金华 丽水 宁波 衢州 绍兴 台州 温 舟山保山 楚雄大理德宏迪庆红河昆明 丽江 临沧 怒江普洱 曲靖 文山 玉溪 昭通白沙保亭 昌江澄迈儋州 定安东方 海口 乐东临高陵水琼海 琼中三沙 三亚 屯昌万宁文昌果洛黄南西宁玉树常州 淮安 南京 南通 苏州 宿迁 泰州 无锡 徐州 盐城 扬州镇江"
        prefix = "坪坡坑塘圩埠埔坝墩垅坊场城堡、溪港湾湖池洼沟洲渠涧河滘洞沙、山岗岛屿岭、集棚楼桥村、矶、口园围、府庄店庙、巷路街、陂陵、寺、祠、寨、营苑、郢、铺、堂、镇、角、里、台、户、丘、井、屯、门、卫、甸"
        result_a = a(input_text)
        result_b = b(input_text)
        result_c = c(prefix)
        w2 = result_a + result_b
        w3 = result_a + result_b + result_c
        fin2 = "".join(w2)
        fin3 = "".join(w3)
        reality = {"广州","苏州","南京","安庆","成都","西安","北京","上海","南昌","台州","泰州","九江","郑州","洛阳","长沙","广安","西宁","天津","长春","吉安","金华","阳江","海南","广东","广西","河北","河南","湖北","湖南","湖东","湖西","江北","江南","江西","江东","山西","山东","山南","山北","南北","东西","江宁","长安","德昌","安阳","海口","湖口","河口","兰州","天津"}
        
        if n == 2 or n == 3:
            if result_a == result_b or fin2 in reality:
                k = k - 1
            else:
                if n == 2:
                    print(k,fin2)
                else:
                    print(k,fin3)
        else:
            print("地名字数错误")
            whole()
            
main()
whole()
